ESBComponents/MessageValidator/src/test/resources/Scenario1_QD_Request.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
	<S:Header>
		<To xmlns="http://www.w3.org/2005/08/addressing">https://D9YF7ZN1.aegis.net:9897/CONNECTGateway/NhinService/RespondingGateway_Query_Service/DocQuery</To>
		<Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:CrossGatewayQuery</Action>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:9e3e481d-f4c8-41fa-a10f-771718163b57</MessageID>
		<wsse:Security S:mustUnderstand="true">
			<wsu:Timestamp wsu:Id="_1" xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/">
				<wsu:Created>2012-02-06T19:12:02Z</wsu:Created>
				<wsu:Expires>2012-02-06T19:17:02Z</wsu:Expires>
			</wsu:Timestamp>
			<saml2:Assertion ID="f82f94ad-f4f8-4931-80b4-59268091c53d" IssueInstant="2012-02-06T19:12:02.799Z" Version="2.0" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema">
				<saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer>
				<saml2:Subject>
					<saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">UID=Scenario 1 QDI-1.1</saml2:NameID>
					<saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:SubjectConfirmationData>
							<ds:KeyInfo>
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>iBZ/n+dEppKXo8ThovFtk4sDERkrrSSHvZ86Ubtn13qjoPTN1rtJSimn2hs1TVBHdKL+yOhBD6vcwmn/5VXytKwf2vdCpASfo/QCjYyzmyhXNBUBEascjI3uv/zodfclVud+4v9c1RFh9kbAh2lY8Y1G8s0q0EyLEFZ4byucx65dtIF/sg09BtyCPKr7YWlFIYoSyH+uiLtYh7GcWmocChSJNVKK95BZ9+hbwX1h9ZNkXXA5R4TeKiE9mTbx55up54jaT6v2gDRv72ZkqLheOoUUXegrRoudqK1ZU/5y+4IfKqVjGZqD99uELVPHN4+xEBfppbuZfuITvSaCAhp/2Q==</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:AuthnStatement AuthnInstant="2012-02-06T19:11:09.871Z" SessionIndex="123456">
					<saml2:SubjectLocality/>
					<saml2:AuthnContext>
						<saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
					</saml2:AuthnContext>
				</saml2:AuthnStatement>
				<saml2:AttributeStatement>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">Lab IT Testcase</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.210</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.210</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">2.16.840.1.113883.0.210</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml2:AttributeValue>
							<hl7:Role code="46255001" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Pharmacist" xsi:type="hl7:CE" xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
						<saml2:AttributeValue>
							<hl7:PurposeForUse code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment" xsi:type="hl7:CE" xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
						<saml2:AttributeValue ns6:type="ns7:string" xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns7="http://www.w3.org/2001/XMLSchema">VEN21000037^^^&amp;2.16.840.1.113883.0.210&amp;ISO</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
				<saml2:AuthzDecisionStatement Decision="Permit" Resource="https://D9YF7ZN1.aegis.net:9897/CONNECTGateway/NhinService/RespondingGateway_Query_Service/DocQuery">
					<saml2:Action Namespace="urn:oasis:names:tc:SAML:1.0:action:rwedc">Execute</saml2:Action>
					<saml2:Evidence>
						<saml2:Assertion ID="91121e3c-a26c-4964-9a71-96e8ad83f1f1" IssueInstant="2012-02-06T19:11:09.875Z" Version="2.0">
							<saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=SAML User,OU=SU,O=SAML User,L=Los Angeles,ST=CA,C=US</saml2:Issuer>
							<saml2:Conditions NotBefore="2012-02-06T19:11:09.875Z" NotOnOrAfter="2012-02-06T19:11:09.875Z"/>
							<saml2:AttributeStatement>
								<saml2:Attribute Name="AccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin"/>
								<saml2:Attribute Name="InstanceAccessConsentPolicy" NameFormat="http://www.hhs.gov/healthit/nhin"/>
							</saml2:AttributeStatement>
						</saml2:Assertion>
					</saml2:Evidence>
				</saml2:AuthzDecisionStatement>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
						<ds:Reference URI="#f82f94ad-f4f8-4931-80b4-59268091c53d">
							<ds:Transforms>
								<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
							<ds:DigestValue>rwzrAUEA1xtGIV3QDgpR5Wz5dfA=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>aOjxxH8X/nYuf07GjqyhACZYX6nAxOcEpQL0W0TngrnYpwECeOOD0zm99+1LrwrCP3W96Va2fAqX
qZUPqcXNBbDiyqudQsWnIBFLgqKWlwy66p2G2PHnndGblE5QqIUgSrzCSSYWCY7nzB1Ug4XBcrsJ
MF5KLsE4DFoJ2FSSwTbVSWokuIDIc8xb6FAWneWNlPHD6BO7VJOVMrBXHGBQgW73kY8eBe23ZZGh
KsmLdxvctKtPqQ9JZU4aZCZhUjnQ0BuznpSApzrE9WL/2noMDQfNfgzHe2S7VM6ddFUM6hPwbXWG
X0FeJAqsJzh6hzQgon81238368WQOcUvmzmygA==</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>iBZ/n+dEppKXo8ThovFtk4sDERkrrSSHvZ86Ubtn13qjoPTN1rtJSimn2hs1TVBHdKL+yOhBD6vc
wmn/5VXytKwf2vdCpASfo/QCjYyzmyhXNBUBEascjI3uv/zodfclVud+4v9c1RFh9kbAh2lY8Y1G
8s0q0EyLEFZ4byucx65dtIF/sg09BtyCPKr7YWlFIYoSyH+uiLtYh7GcWmocChSJNVKK95BZ9+hb
wX1h9ZNkXXA5R4TeKiE9mTbx55up54jaT6v2gDRv72ZkqLheOoUUXegrRoudqK1ZU/5y+4IfKqVj
GZqD99uELVPHN4+xEBfppbuZfuITvSaCAhp/2Q==</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
			</saml2:Assertion>
			<ds:Signature Id="_2" xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://schemas.xmlsoap.org/soap/envelope/">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<exc14n:InclusiveNamespaces PrefixList="wsse S"/>
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
					<ds:Reference URI="#_1">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<exc14n:InclusiveNamespaces PrefixList="wsu wsse S"/>
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<ds:DigestValue>JAfqkAfEVUR66s3MWTfuLZQFSCM=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>RNprXCfloOY6KH1FRxg5XcbWJ82tkLRiSaUWdouRqQGGpLaaxjp97sVkzm+NM7jt8rof93QwP0pcVbsFpJGtJ3VLZ4Rl/LExC9E6i8AKbG/uITx8cNJhpm+S9iefDZMpqvMm7hKCAgUfDlx7mXS+A6BMx067vPRvHfE/0BTryY7fJJ9Pi7oI3m6/5oar4IH32yN44k2SNbwSqSnzgTp2X2vOgNTAiqM8h4oKQuwEIs74AvrB/NGGbhJOxUrKJkOXormd9KgVEoRVZ3nUhfnJqyoq7IVzXzka5CmV6Tr+ef8c9lRll8oQfi0VOenvgguwMYpDFNDtgUMwKHKqLas3IQ==</ds:SignatureValue>
				<ds:KeyInfo>
					<wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
						<wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">f82f94ad-f4f8-4931-80b4-59268091c53d</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</S:Header>
	<S:Body>
		<ns4:AdhocQueryRequest maxResults="-1" startIndex="0" federated="false" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns6="urn:gov:hhs:fha:nhinc:gateway:samltokendata">
			<ns4:ResponseOption returnComposedObjects="false" returnType="LeafClass"/>
			<ns2:AdhocQuery home="2.16.840.1.113883.0.101" id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
				<ns2:Slot name="$XDSDocumentEntryPatientId">
					<ns2:ValueList>
						<ns2:Value>'RI1.101.00037^^^&amp;2.16.840.1.113883.0.101&amp;ISO'</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
				<ns2:Slot name="$XDSDocumentEntryStatus">
					<ns2:ValueList>
						<ns2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</ns2:Value>
					</ns2:ValueList>
				</ns2:Slot>
			</ns2:AdhocQuery>
		</ns4:AdhocQueryRequest>
	</S:Body>
</S:Envelope>
