samples/query_req.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <To xmlns="http://www.w3.org/2005/08/addressing">http://xdsb.dew.org/XDSDocumentRegistryQuery/RegistryStoredQuery</To>
    <Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RegistryStoredQuery</Action>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
    <FaultTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </FaultTo>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:adaac6f4-3aa0-4704-8ed7-47d5fc75c3ed</MessageID>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_f80159cc45f769f9224695714a806655" IssueInstant="2016-03-03T14:55:51.778Z" Version="2.0" xsi:schemaLocation="urn:oasis:names:tc:SAML:2.0:assertion saml-schema-assertion-2.0.xsd">
        <saml2:Issuer>120</saml2:Issuer>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_f80159cc45f769f9224695714a806655">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>KgxSprCBGAkBb6gB3K4kiMtQzpg=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>cGU4UFnjRS1souCyEPQJL+DSArljRMFrVbkNb7kgJEhYbr7JN5ildbh4JGgaC82CU1ZvlB1VbFiYev+NDN2V1VUjg22apPtRdHUTBs2pEUKWql1vD0vGBiz7KhC8XdO7eSrjWlMedN/0s8r7MgDyyMeGym+QQIDe92R/hlT/AQ6KxOz11pBf9hHJa7wHQYQqJrVnhpYnIslwaJrSRAJVPrb7GiOIe/rwCLvHiF7L17cKkUEeb5jN+Aj8aqUpNPCTVh/a63C3l9x52y+OXfY6OIc7WGTstq2pYJtSYCBMh+JiUGqM43UWRpAwaR5/BwOHPRZXoWLusG/DL8lWuss0gw==</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:X509Data>
              <ds:X509Certificate>
                MIID+zCCAuOgAwIBAgIBEjANBgkqhkiG9w0BAQsFADCBiDELMAkGA1UEBhMCSVQxETAPBgNVBAgT
                CENhbXBhbmlhMQ8wDQYDVQQHEwZOYXBvbGkxDDAKBgNVBAoTA0NOUjENMAsGA1UECxMESUNBUjEZ
                MBcGA1UEAxMQRlNFIFJPT1QgQ0EgVEVTVDEdMBsGCSqGSIb3DQEJARYObm9yZXBseUBjbnIuaXQw
                HhcNMTYwMjA4MDAwMDAwWhcNMzUxMjE3MjM1OTU5WjCBlzELMAkGA1UEBhMCSVQxDjAMBgNVBAgT
                BUxhemlvMQ0wCwYDVQQHEwRSb21hMRYwFAYDVQQKEw1SZWdpb25lIExhemlvMRYwFAYDVQQLEw1S
                ZWdpb25lIExhemlvMRAwDgYDVQQDEwdGU0UgTEFaMScwJQYJKoZIhvcNAQkBFhhub3JlcGx5QHJl
                Z2lvbmUubGF6aW8uaXQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCquIPCj64y90SZ
                p0r+KTip+TxHNHQkKIEKvScc4Seo02t/6U6r4Q14quc4K2gnvzlvPRV/Ly2VrKEVJOL5JFJ8vwjn
                JICX1KEuh+OqBRotNO9BAp1Zh8Roxb82Y+5Ce8eXdgicbeFPQ173TXIDaf+g+Rou+FGGShycjngG
                m1oQXw4tEnP/FVZpjstF9fy7jwaG2UnZX+9jxJZtNxlXj03Io8Ug5NVEiOMZ5/tqN9q33SYcYYd/
                gh0QRlXPjvwT6fhNyxB0zevGBJcENkgshYxPXO9p/jEpx5ifUZZsXNEMZrIb9db21wWPDaKhN4Ir
                +MpZtdU6eNIB/QGwoaMuJ5ADAgMBAAGjXzBdMAwGA1UdEwEB/wQCMAAwHQYDVR0OBBYEFBPo4oLk
                mH66i7Q6Jb2NqyGNMXXEMA4GA1UdDwEB/wQEAwIF4DAeBglghkgBhvhCAQ0EERYPeGNhIGNlcnRp
                ZmljYXRlMA0GCSqGSIb3DQEBCwUAA4IBAQCU8QdtsFyAOlo/736P7lUF8KZbTQnD+hhxJHK0OVSz
                dIJlH7wIMncW86h652dNHfDf4W0IwEASiz6mv4z6hG51KG7wPLGaqXQp8y42OjMq88iieBmNkluJ
                1Agnokw7N/bIoFvgpvb+3l/YKK5OqDzXyz46YmDbehrempoBYDK4mPlS4GAXfQ0nqItxD3RCkRUB
                h1+JUx+Dvc9UC+P0oU3ZjoAfp+wNletWGStXqHvRKjut7lwz8Ifh8BBkoSYBnkq6hgRIePiizROf
                KCKp9hIfR5C1xiPaeGqcNJfAyGgLFTlmrMCRZvptNMpR3ZOyYrn9XzVDON4Ox5Ri4O50GSMI
              </ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID>VRDMRC67T20I257E^^^&amp;2.16.840.1.113883.2.9.4.3.2&amp;ISO</saml2:NameID>
        </saml2:Subject>
        <saml2:Conditions NotBefore="2016-03-03T13:55:51.778Z" NotOnOrAfter="2016-03-04T14:55:51.778Z"/>
        <saml2:AuthnStatement AuthnInstant="2016-03-03T14:55:51.778Z">
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">APR</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:environment:locality" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">120037</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">TREATMENT</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:resource:hl7:type" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">('60591-5^^2.16.840.1.113883.6.1','11502-2^^2.16.840.1.113883.6.1')</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">120</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">VRDMRC67T20I257E^^^&amp;2.16.840.1.113883.2.9.4.3.2&amp;ISO</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">Regione Lazio</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">RSSMRA75C03F839K^^^&amp;2.16.840.1.113883.2.9.4.3.2&amp;ISO</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:resource:patient:consent" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">true</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:action:action-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xsi:type="xs:string">READ</saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
      </saml2:Assertion>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <ns3:AdhocQueryRequest xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
      <ns3:ResponseOption returnComposedObjects="false" returnType="LeafClass"/>
      <AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
        <Slot name="$XDSDocumentEntryPatientId">
          <ValueList>
            <Value>RSSMRA75C03F839K^^^&amp;2.16.840.1.113883.2.9.4.3.2&amp;ISO</Value>
          </ValueList>
        </Slot>
        <Slot name="$XDSDocumentEntryStatus">
          <ValueList>
            <Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</Value>
          </ValueList>
        </Slot>
        <Slot name="$XDSDocumentEntryTypeCode">
          <ValueList>
            <Value>('60591-5^^2.16.840.1.113883.6.1','11502-2^^2.16.840.1.113883.6.1')</Value>
          </ValueList>
        </Slot>
      </AdhocQuery>
    </ns3:AdhocQueryRequest>
  </soap:Body>
</soap:Envelope>